УТ_для_edt/src/InformationRegisters/смартЛицензииПО/смартЛицензииПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартЛицензииПО</name>
  <comment>#Б-3180 смарт: Лопато 10.07.2025 //Лицензии IECHO. Отражение в учетной программе.</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТипЛицензии</name>
    <type>
      <types>EnumRef.смартТипыЛицензии</types>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУстановкиПостояннойЛицензии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаПускоНаладку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартТипыЛицензии/смартТипыЛицензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартТипыЛицензии</name>
  <comment>#Б-3180 смарт: Лопато 10.07.2025 //Лицензии IECHO. Отражение в учетной программе.</comment>
  <enumValues>
    <name>Временная</name>
  </enumValues>
  <enumValues>
    <name>Постоянная</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/смартЛицензииПО/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
	Элементы.Заявка.ТолькоПросмотр 		 = НЕ ЭтоПолноправныйПользователь;
	Элементы.Номенклатура.ТолькоПросмотр = НЕ ЭтоПолноправныйПользователь;
	Элементы.Серия.ТолькоПросмотр 		 = НЕ ЭтоПолноправныйПользователь;

	Если Параметры.Ключ.Пустой() Тогда
		
		Запись.ТипЛицензии = Перечисления.смартТипыЛицензии.Временная;
		
	Иначе
		
		Если Запись.ТипЛицензии = Перечисления.смартТипыЛицензии.Постоянная
			И НЕ ЭтоПолноправныйПользователь Тогда
			
			Элементы.ТипЛицензии.ТолькоПросмотр  					= Истина;
			Элементы.Период.ТолькоПросмотр 		 					= Истина;
			Элементы.ДатаОкончания.ТолькоПросмотр 					= Истина;
			
		КонецЕсли;;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДатуОкончания()
	
	Если Запись.ТипЛицензии = ПредопределенноеЗначение("Перечисление.смартТипыЛицензии.Временная") Тогда
		
		Если ЗначениеЗаполнено(Запись.Период) Тогда
			Запись.ДатаОкончания = Запись.Период + 30 * 24 * 60 * 60;
		КонецЕсли;
		
	Иначе
		
		Запись.ДатаОкончания = Неопределено;
		
		Если НЕ ЗначениеЗаполнено(Запись.ДатаУстановкиПостояннойЛицензии) Тогда
			Запись.ДатаУстановкиПостояннойЛицензии = ТекущаяДата();
		КонецЕсли;	
		
	КонецЕсли;	
	
	ЭтоПостояннаяЛицензия 
		= Запись.ТипЛицензии = ПредопределенноеЗначение("Перечисление.смартТипыЛицензии.Постоянная");
	
	Элементы.ДатаОкончания.ТолькоПросмотр 			   = ЭтоПостояннаяЛицензия;
	Элементы.ДатаУстановкиПостояннойЛицензии.Видимость = ЭтоПостояннаяЛицензия;
		
КонецПроцедуры

&НаКлиенте
Процедура ТипЛицензииПриИзменении(Элемент)
	
	РассчитатьДатуОкончания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)

	РассчитатьДатуОкончания();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Параметры.Ключ.Пустой() Тогда
		
		РассчитатьДатуОкончания();

		УстановитьСерийныйНомерНаСервере();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСерийныйНомерНаСервере()

	Если ЗначениеЗаполнено(Запись.Серия) Тогда
		
		НомерСерии = СокрЛП(Запись.Серия.Номер);
		
		Если Запись.СерийныйНомер <> НомерСерии Тогда
			Запись.СерийныйНомер = НомерСерии;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	УстановитьСерийныйНомерНаСервере();
	
КонецПроцедуры
